# Brewfile for HBP ML Scientist Dev Machine
# Install with: brew bundle install

# ============================================
# Taps (Additional Repositories)
# ============================================
tap "homebrew/bundle"

# ============================================
# Development IDEs & Editors
# ============================================
cask "cursor"                    # AI-enhanced code editor (primary)
cask "visual-studio-code"        # Backup editor

# ============================================
# Terminal & Shell
# ============================================
cask "warp"                      # Modern terminal with AI
cask "iterm2"                    # Alternative terminal (backup)

# ============================================
# Database Tools
# ============================================
cask "dbeaver-community"         # Universal database GUI (for Snowflake)

# ============================================
# Version Control
# ============================================
brew "git"                       # Version control
brew "gh"                        # GitHub CLI

# ============================================
# Text Editors (Terminal)
# ============================================
brew "neovim"                    # Terminal editor (LazyVim)

# ============================================
# Search & File Tools
# ============================================
brew "ripgrep"                   # Fast grep alternative (rg)
brew "fd"                        # Fast find alternative
brew "fzf"                       # Fuzzy finder
brew "tree"                      # Directory tree viewer

# ============================================
# File Viewers & Utilities
# ============================================
brew "bat"                       # Better cat with syntax highlighting
brew "eza"                       # Better ls with icons
brew "jq"                        # JSON processor

# ============================================
# Network & HTTP Tools
# ============================================
brew "curl"                      # Transfer data with URLs
brew "wget"                      # File downloader
brew "httpie"                    # Human-friendly HTTP client

# ============================================
# Python (Note: Using uv for actual Python management)
# ============================================
# Python itself installed via uv, not Homebrew
# brew "python@3.12"             # Commented out - use uv instead

# ============================================
# Optional but Useful
# ============================================
# brew "tmux"                    # Terminal multiplexer
# brew "htop"                    # System monitor
# cask "docker"                  # Containers (if needed)
# cask "postman"                 # API testing
